tbobd/certification2/test6/HotelCancelRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
    </hot:Credentials>
    <wsa:Action>http://TekTravel/HotelBookingApi/HotelCancel</wsa:Action>
    <wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelCancelRequest>
        <hot:ConfirmationNo>51HFTJ</hot:ConfirmationNo>
        <hot:RequestType>HotelCancel</hot:RequestType>
        <hot:Remarks>test cancelhotel</hot:Remarks>
    </hot:HotelCancelRequest>
</soap:Body>
</soap:Envelope>